{"content": "\n## Introduction\n\nHey everyone, this is the first of my GSoC'25 blog posts \nwhile working under LPython: PSF summarizing my weekly work.\n\nHuge thanks to my mentor @certik for being extremely supportive\n\n## Weekly Agenda\n\nThe backend of LPython referred to as `libasr` is shared\nwith LPython's sister project LFortran which is more actively\ndeveloped and significantly better tested. Occasionally contributors\nto the LPython project need to sync each libasr in the past when \nthey were seperate which was an extremely tedious task.\n\nNow we have updated the workflow to use a submodule pointing to \nthe LFortran repo which makes it much easier keep LPython's frontend\ncompliant with the backend.\n\nMy original plan was to make LPython functional after the last sync but there was a blocker since LFortran is having major changes to its string type in the backend. So as that is going on I'm going to be implementing python specific data-types like list, set, etc which are present in the backend but not tested for LLVM > 16. Prior to the GSoC acceptance I had fixed these data types for LLVM < 16 after the sync, but we only found out there bugs for higher LLVM version after exposing them in LFortran because of the better test coverage.\n\n\n## Achievements\n\n- Exposed specific List, Set types to the LFortran frontend\n- Fixed bugs that were highlighted from better testing\n- Implemented simple related builtins as intrinsics\n\n## Code Samples\n\nCode like below now runs on LFortran using LFortran specific intrinsics which can compile into llvm and wasm.\n\n```f90\nprogram lp_list\n\n    integer :: x\n    \n    type(_lfortran_list_integer) :: test_list \n    call _lfortran_list_append(test_list, 1)\n    x = _lfortran_len(test_list)\n\n    test_list = _lfortran_list_constant(1, 2, 3, 4)\n\n    type(_lfortran_set_integer) :: test_set \n    test_set = _lfortran_set_constant(1, 2, 3, 4, 4, 5, 4, 10)\n    call _lfortran_set_add(test_set, 1)         \n    x = _lfortran_len(test_set)\n    if (x /= 7) error stop\n\n    test_set = _lfortran_set_constant(1, 2, 3, 4)\n    call _lfortran_set_add(test_set, -50)\n    ! Add other intrinsics later\nend program\n```\n            \n\n## Pull Requests\n\n- [#7419 List implementation](https://github.com/lfortran/lfortran/pull/7419)\n- [#7459 Misc PR towards compiling toml-f](https://github.com/lfortran/lfortran/pull/7459)\n- [#7462 Set implementation](https://github.com/lfortran/lfortran/pull/7462)\n"}